package com.javarush.quest.kurochkin;

public class Texts {
    public String beforeFightForCaptainText(){
        return "Вы решили спасти капитана. Медленно подобравшись к нему, вы тихо будите его, развязывая верёвки и освобождая кэпа." +
                " Внезапно у капитана из кармана выпадает монета, которая со звоном ударяется о палубу. Пират, дремавший неподалёку, открывает глаза, " +
                "и, заметив вас, хватается за саблю. Чёрт! Придётся сражаться!";
    }
    public String candlestickAndHenry(){
        return "Взять подсвечник было явно не лучшей идей, но кто знал!? Вам совершенно нечем защититься, но вдруг в бой вступает раненый Генри и убивает пирата. К сожалению, в бою он ещё раз был ранен, и обессилев, погибает. Вам остаётся только спасаться бегством, так как на корабле поднялся шум, и скоро здесь будет полно пиратов.";
    }
    public String candlestickWithoutHenry(){
        return "Взять подсвечник было явно не лучшей идей, но кто знал!? Вам совершенно нечем защититься, а пират приближается всё ближе и ближе…";
    }
    public String saberAndHenryWin(){
        return "Ваша сабля и чуть-чуть удачи сделали своё дело, пират поражён, а капитан спасён! Однако на корабле поднялся шум, и скоро здесь будет полно пиратов.";
    }
    public String saberAndHenryDefeat(){
        return "Сегодня вам сильно повезло: вы выжили после нападения на ваш корабль. Но везение не могло быть вечным: рукоятка вашей сабли в пылу боя с треском ломается, а пират наносит смертельное ранение. Падая на палубу вы замечаете, как воспользовавшись моментом Генри наносит сокрушительный удар по противнику, и последний без чувств падает навзничь.";
    }
    public String saberWithoutHenryWin(){
        return "Ваша сабля и чуть-чуть удачи сделали своё дело, пират поражён, а капитан спасён! Однако на корабле поднялся шум, и скоро здесь будет полно пиратов.";
    }
    public String saberWithoutHenryDefeat(){
        return "Сегодня вам сильно повезло: вы выжили после нападения на ваш корабль. Но везение не могло быть вечным: рукоятка вашей сабли в пылу боя с треском ломается, а пират наносит вам смертельное ранение.";
    }
    public String chainAndHenryWin(){
        return "Ваша железная цепь, выдающиеся навыки борьбы и чуть-чуть удачи сделали своё дело, пират поражён, а капитан спасён! Однако на корабле поднялся шум, и скоро здесь будет полно пиратов.";
    }
    public String chainAndHenryDefeat(){
        return "Сегодня вам сильно повезло: вы выжили после нападения на ваш корабль. Но везение не могло быть вечным, да и сражаться цепью против сабли – занятие сомнительное. Пират наносит вам смертельное ранение. Падая на палубу вы замечаете, как воспользовавшись моментом Генри наносит сокрушительный удар по противнику, и последний без чувств падает навзничь.";
    }
    public String chainWithoutHenryWin(){
        return "Ваша железная цепь, выдающиеся навыки борьбы и чуть-чуть удачи сделали своё дело, пират поражён, а капитан спасён! Однако на корабле поднялся шум, и скоро здесь будет полно пиратов.";
    }
    public String chainWithoutHenryDefeat(){
        return "Сегодня вам сильно повезло: вы выжили после нападения на ваш корабль. Но везение не могло быть вечным, да и сражаться цепью против сабли – занятие сомнительное, и пират наносит вам смертельное ранение.";
    }
    public String revolver(){
        return "Ха! На что вообще надеялся пират? Звучит выстрел, дым вашего от револьвера моментально подхватывает и уносит ветер. Капитан спасён, но вам остаётся только спасаться бегством, так как на корабле поднялся шум, и скоро здесь будет полно пиратов.";
    }
}
